interface ReviewData {
  id: number;
  category: number;
  image: string;
  title: string;
  tag1: string;
  tag2: string;
  date?: string;
  author?: string;
  editorNote?: string;
  text1?: string;
  text2?: string;
  text3?: string;
  text4?: string;
  image1?: string;
  image2?: string;
  image3?: string;
}

export const ReviewData: ReviewData[] = [
  // 국어
  {
    id: 1,
    category: 1,
    image: "/assets/study/review/korean1.svg",
    title: "3단원. 높임표현 연습에는 역할극!",
    tag1: "역할극",
    tag2: "문제해결력증진",
    date: "2024년 5월 24일",
    author: "김동우",
    editorNote:
      "우리 아이 존댓말 연습 어떻게 시키고 계시나요? 요즘에는 어린 연령부터 미디어 매체에 노출되는 만큼 잘못된 언어습관이 체화되는 경우가 많다고 합니다. 높임 표현에 대한 올바른 숙지를 위해서 해볼 수 있는 재미있는 역할극을 가져와봤으니 함께해주세요! ",
    text1:
      "안녕하세요 :) 벌써 5월에 접어들었어요 :) 가정의 달인 5월인 만큼 모든 가정에 평화가 깃들길 진심으로 바라겠습니다  ^^",
    text2:
      "요즘, 우리 아이들은 학교에서 올바른 높임 표현에 대해서 배워보고 있어요! 우리 아이는 상황에 맞는 적절한 높임 표현을 사용하고 있나요? 높일 사람을 낮추지는 않나요? 혹은 지나치게 높이고 있지는 않을까요? 자녀와 높임 표현을 함께 연습해보기 좋은 간단한 역할극을 가져와봤어요.\n\n역할극은 아래와 같은 순서로 진행해볼게요!\n듣는 사람을 높이는 경우\n문장에서 주어를 높이는 경우\n문장에서 대상을 높이는 경우\n\n먼저 듣는 사람을 높이는 경우, 나보다 나이가 많은 어른/어르신들과 함께 대화하는 경우나 격식을 차려야 하는 공식 석상에서 이렇게 이야기해볼 수 있었겠죠.\n\n이 역할극에서는 참신하게 요즘 유행하는 연예인이 되어보았다고 생각하고 인터뷰를 해볼게요. 저는 요즘 대세인 장원영을 예시로 들었는데, 아이가 좋아하는 연예인이나 배우로 해보아도 좋아요 ~ !! ",
    text3:
      "연예인/배우가 되었다는 상황을 가정해보고, 여러 가지 공식 석상에서 나올법한 인터뷰 질문을 던져주세요! 아이의 답변에 대해 수정이 필요한 부분을 바로 잡아주시고요 ~ ㅎㅎ\n\n다음은 문장에서 주어를 높이는 경우예요! 주로 ~께서와 서술어에 ‘-시-’를 높이는 경우가 이에 해당하겠죠?\n\n우리 아이가 이웃집 아주머님께 떡을 갖다드리는 상황이라고 가정해보고 역할극을 진행해보세요. 아이가 이웃집 아주머님을 올바르게 높이고 있는지를 확인해보시면서, 아이가 잘못 말한 부분에 대해서는 수정을 함께 해주세요!\n\n마지막으로는 대상을 높이는 경우입니다. 이 때는 우리 아이가 카페 아르바이트생이 되어보는 거에요.",
    text4:
      "카페 아르바이트생이 되어보면서, 우리가 흔히 말하는 ‘커피 나오셨습니다’ 등과 같은 문제 상황은 발생하지 않는지, 손님을 대할 때 적절한 높임 표현을 사용하는지, 올바른 대상을 높이고 있는지를 검토해주세요.\n\n아이가 다양한 상황 속에서 적절한 높임 표현을 연습해보는 좋은 활동이 되어볼 수 있어요 :) 오래 걸리지 않는 활동이면서 아이와 재미있게 해볼 수 있으니 강력 추천! 드립니다.\n\n그럼 다음에 더 좋은 콘텐츠로 찾아오겠습니다.\n오늘도 수고 많으셨어요 ~",
    image2: "/assets/study/detail/korean2.svg",
    image3: "/assets/study/detail/korean3.svg",
  },
  {
    id: 2,
    category: 1,
    image: "/assets/study/review/korean2.svg",
    title: "4단원. 마음 담아 선생님께 편지쓰기",
    tag1: "편지쓰기",
    tag2: "맞춤법연습",
    date: "2024년 5월 24일",
    author: "김동우",
    image1: "/assets/study/detail/korean4.svg",
    image2: "/assets/study/detail/korean5.svg",
    editorNote:
      "5월 스승의 날을 맞이하여 국어 4단원. ‘내 마음을 편지에 담아’ 단원과 함께해보기 좋은 활동을 가져와봤어요! 이번 스승의 날에는 선물보다는 정성담아 한 자씩 꾹꾹 눌러담아쓴 우리 아이 편지를 드려보는 건 어떨까요? ",
    text1:
      "안녕하세요 :) 5월이 가정의 달인만큼 행사가 많아 정신 없으신 일상들을 보내고 계실 것 같아요! 오늘은 국어 (가) 4단원. 마음을 담아 편지쓰기 단원과 함께하기 좋은 선생님께 편지쓰기 활동을 가져와봤어요. ",
    text2:
      "먼저, 편지의 형식에 대해서 설명해줍니다.\n\n가장 시작은 받을 사람 그리고 첫 인사, 전하고 싶은 말, 끝 인사, 쓴 날짜와 쓴 사람으로 마지막을 작성할 수 있도록 안내합니다.\n\n형식에 대한 설명이 끝났다면, 평소 우리반 선생님에 대해 감사했던 일은 무엇이 있었는지, 왜 감사했는지, 그 때의 나의 감정은 어땠는지 함께 이야기해볼 수 있도록 합니다. ",
    text3:
      "아이가 뱉었던 경험을 바탕으로, 편지 쓰기를 시작해주시면 되는데요! 이 때 전 차시에 배웠던 높임 표현도 함께 연습해볼 수 있답니다. 읽는 사람을 고려하여 글씨, 존댓말을 쓸 수 있도록 해주세요. 아이가 문장을 만들기 어려워할 때마다 학부모님께서 옆에서 아이가 현재 어떤 맥락을 담고 싶은지 계속해서 물어봐주세요. 그리고 해당 내용을 한 번 더 정리해주시면 아이가 훨씬 수월하게 작성을 해볼 수 있답니다. \n\n편지를 다 썼다면 마지막으로 검토! 하는 습관을 들일 수 있도록 해주세요.\n1. 편지의 형식에 맞게 썼는지\n2. 마음을 전하고 싶은 일이  잘 드러나는지\n3. 그 때의 생각과 느낌이 잘 전달되는지\n4. 받는 대상에 적절한 표현을 사용했는지\n를 아이와 함께 확인해주세요 :)\n\n이렇게 하면 최근에 배운 높임 표현과 마음을 담아 적절하게 편지 쓰는 법에 대한 가정 학습 끝입니다 :) 아이와 함께 선생님께 편지 쓰는 시간이 유익하게 다가오셨길 바라며 다음 수업 때 더욱 좋은 정보로 찾아올게요!\n\n오늘도 고생 많으셨습니다~",
  },

  // 수학
  {
    id: 3,
    category: 2,
    image: "/assets/study/review/math1.svg",
    title:
      "5단원. 마의 구간 ‘길이와 시간’ 여름방학 계획표 만들기로 시간 마스터하기",
    tag1: "실생활연습",
    tag2: "탐구생활",
    date: "2024년 5월 24일",
    author: "김동우",
    image1: "/assets/study/detail/math1.svg",
    image2: "/assets/study/detail/math2.svg",
    editorNote:
      "학생들이 수학을 배우다가 처음으로 어려움을 겪는 시기가 바로 초등학교 3학년 ‘길이와 시간’ 단원을 배울 때 시작된다고 해요. 길이와 시간에 대한 개념 연습은 실생활에서 다뤄보는 것이 제일 중요한데요! 우리 아이 첫 단추! 잘 끼워보고 싶다면 정독~ 해주세요!",
    text1:
      "안녕하세요! 어느덧 1학기가 마무리되는 시점이 슬슬 다가오고 있는데요~ 남은 단원도 얼마 남지 않았네요^^\n\n흔히 말하는 수포자가 나오기 시작한다는 3학년 1학기, 우리 학부모님들 고비를 잘 넘기고 계실까요? 가장 큰 산인 ‘길이와 시간’ 단원이 찾아와버렸네요. 길이와 시간 단원 개념은 이론도 중요하지만, 실생활에 직접 적용해보면서 직감적으로 체득하는 것이 가장 핵심입니다. 그러면 일상 속에서 아이들과 함께 길이와 시간에 대해 배워볼 수 있는 활동들을 설명해드리도록 하겠습니다. ",
    text2:
      "활동은 어렵지 않아요. 여름방학이 얼마 남지 않은 시점에서 우리 아이와 함께 여름 방학 계획표를 세워보면서 길이와 시간을 연습해볼 수 있도록 하는 건데요! 자녀가 몇 시간동안 무엇을 할 지 생각해보고 시간 위계에 대응하게 하루 일정 시간표를 그려볼 수 있도록 하는 거예요. ",
    text3:
      "24시간을 쭉 나눠보고 시간 단위에 아이가 익숙해지게 해주세요. 그리고 시간 단위에 대한 연습을 충분히 해본 후에 우리 아이가 여름 방학에 무엇을 하고 싶은지를 이야기해보고 이를 바탕으로 해당 일정들에 소요 시간을 함께 고민해주세요.\n\nstep 1. 하루를 24시간으로 나눠보고 시간 단위에 익숙해지기 (ex. 13시는 몇 시일까? 00이는 18시에 무엇을 주로 할까?) \n\nstep 2. 자녀가 하고자 하는 일에 대한 소요 시간을 함께 이야기해보세요. (ex. 00이가 줄넘기를 월요일마다 가잖아, 줄넘기 수업은 얼마나 해? 그럼 줄넘기를 하고 집에 오면 몇 시일까? \n\nstep 3. 방학 시간표를 함께 고민해주세요\n\nstep 4. 함께 짜본 각 일정 별 소요 시간에 대해 하루 24시간을 차지하는 길이를 함께 작성해봐요. 이 때 24시간을 일렬로 늘여놓은 시각적인 도구가 함께 있으면 좋아요.\n\n자녀 여름 방학 계획표도 함께 짜보고, 우리 아이 시간 개념 학습에도 도움이 되는 일석 이조의 활동이랍니다. 더불어, 아이가 함께 주체적으로 계획을 세워보는 활동이 될 수 있어요.\n\n수포자가 많이 나오기 시작하는 단원인만큼, 학부모님들의 걱정이 많으실텐데요! 실생활에서 찾아보기 쉬운 개념인만큼 실생활 기반 활동들을 통해 아이가 개념에 대해 익숙해질 수 있도록 자극점을 찾아주시는 게 중요하답니다:)\n\n그럼 다음에 또 유익한 정보로 찾아오겠습니다 안녕~",
  },

  // 사회
  {
    id: 4,
    category: 3,
    image: "/assets/study/review/society1.svg",
    title: "2단원. 우리 고장 문화유산 달력 만들기",
    tag1: "만들기",
    tag2: "사회탐구",
    date: "2024년 5월 24일",
    author: "김동우",
    image1: "/assets/study/detail/society1.svg",
    editorNote:
      "우리 고장 문화유산 달력 만들기를 통해 무형문화유산인 전통축제를 살펴봅니다. 전통 축제 일정을 달력에 표시하고, 축제 현장을 그림으로 그리며 재미있게 공부해요!",
    text1:
      "우리 아이들, 옛것이라면 어찌나 지루해하는지~ 역사라면 노잼이라고 생각하는 아이들 참 많잖아요. ‘고장’, ‘문화유산’ 이라는 단어도 아이들에게는 생소할테고요. 아이돌이라면 몰라도 전통 축제에 대해서 알고 있는 아이들은 많지 않을 겁니다.\n\n조금은 고지식해보일 수 있는 해당 개념들을 좀 더 재미있게, 좀 더 MZ스럽게 접할 수 있게 해주고 싶더라고요 ~ 요즘 아이들 사이에서 ‘00 꾸미기’ 가 유행이라는 것은 많이 알고 계실텐데요. 포토카드, 다이어리, 가방 등등 다양한 물건을 본인의 취향대로 꾸미는 것이 많은 인기를 얻고 있습니다.\n\n이런 트렌드를 접목해, 우리나랑 내용을 바탕으로 <나만의 달력 꾸미기> 를 진행해보면 좋을 것 같아요. 전통 축제 날짜를 달력에 표시하고, 상단에는 축제 현장을 상상하며 일러스트를 직접 그리는 방식인데요.",
    text2:
      "하단에 적힌 전통축제의 예시 중 하나를 골라 아이들이 직접 찾아보고 진행해도 좋을 것 같고요. 아이들이 직접 인터넷에 검색해 자신이 원하는 축제를 골라 진행한다면 금상첨화겠지요 ~\n\n*전통축제 예시 : 춘향제, 단오제, 지용제, 정선아리랑제, 통영한산대첩축제, 진주논개제, 익산서동축제, 청룡문화제\n\n학교에서는 선생님이 설명해주시는 전통축제 내용을 듣고만 있으니, 그냥 흘려 듣고 마는 경우가 많은데요.\n직접 축제 일정과 내용을 찾아보고, 축제 현장을 그림으로 그리다보니 훨씬 와닿는 공부가 될 것이라고 생각해요. 게다가 자신이 직접 꾸민 달력을 책상 위에 두고, 매일 매일 뿌듯해하며 확인한다면 학습 효과는 2배!\n\n자칫 지루해서, 등한시 할 수 있는 사회과 2단원의 내용을 재미있게 공부할 수 있는 방법을 소개해드렸는데요. 우리 고장의 전통축제 문화유산을 잊지 않고, 그 가치를 소중하게 여기는 우리 아이들이 되었으면 좋겠습니다 ^^",
  },

  // 과학
  {
    id: 5,
    category: 4,
    image: "/assets/study/review/math1.svg",
    title: "3. 서로 다른 물질을 섞었을 때 나타나는 성질 변화 관찰하기",
    tag1: "탱탱구슬만들기",
    tag2: "과학적사고력",
    date: "2024년 5월 24일",
    author: "김동우",
    image1: "/assets/study/detail/science1.svg",
    image2: "/assets/study/detail/science2.svg",
    image3: "/assets/study/detail/science3.svg",
    editorNote:
      "오늘은 서로 다른 물질을 섞었을 때 나타나는 성질 변화를 관찰하는 실험에 대해 알려드릴 겁니다! 단계에 따라 집에서 아이와 함께 실험해 보세요!",
    text2:
      "본격적으로 서로 다른 물질을 섞는 실험을 시작해보겠습니다!\n\n준비물은 아래와 같습니다.\n준비물 : 따뜻한 물이 담긴 비커 2개, 알긴산 나트륨, 염화 칼슘, 페트리 접시 세 개, 돋 보기, 실험용 장갑, 약 숟가락 세 개, 유리 막대 두 개, 일회용 스포이트",
    text3:
      "첫 번째로는 물, 알긴산 나트륨, 염화 칼슘 세 물질을 자유롭게 관찰해보는 활동을 합니다\n오감을 이용해서 물질을 느껴보면 더욱 잘 느낄 수 있는데요. 예를 들어 실험용 장갑을 끼고 세 물질을 만졌을 때의 감상을 자유롭게 종이에 적어봅시다. 이 때 알긴산 나트륨과 염화 칼슘을 먹거나 코로 들이마시지 않도록 실험 전에 가정에서 사전 지도가 필요합니다. 가루물질은 부모님이 허락할 때만 만져보게끔 하는 것도 팁입니다.",
    text4:
      "두 번째로는 탱탱 구술 만들기 활동입니다. 따뜻한 물이 반쯤 담긴 비커에 알긴산 나트륨 한 숟가락을 넣고, 유리 막대로 충분히 저으면서 나타나는 현상을 관찰 해 봅니다. 이어 따뜻한 물이 반쯤 담긴 비커에 염화 칼슘 반 숟가락을 넣고, 유리 막대로 충분히 저으면서 나타나는 현상을 관찰해 봅니다. 다음으로 일회용 스포이트를 이용하여 첫 번째 비커로부터 액체를 한 방울 추출해 두 번째 비커에 떨어뜨리면서 나타나는 현상을 관찰해 봅니다.\n\n마지막으로 두 번째 비커에서 만들어진 탱탱 구술을 약숟가락을 이용하여 페트리 접시에 옮겨 담은 후 특징을 관찰해 봅니다.\n\n오늘 실험을 통해서는 물의 성질, 알긴산 나트륨과 염화 칼슘의 성질에 대해 색깔, 알갱이 크기, 손으로 만졌을 때 느낌에 대해 정리할 수 있습니다. 또한 세 물질을 섞어 만든 탱탱 구슬 물질은 섞기 전 물질들과는 아예 다른 성질을 가지고 있음을 확인할 수 있습니다.\n\n학교에서 배운 물질의 성질에 대해 가정에서 실험으로 한 번 더 복습해보는 건 어떨까요?",
  },

  // 영어
  {
    id: 6,
    category: 5,
    image: "/assets/study/review/english1.svg",
    title: "7단원: 팝송 숏폼 촬영을 통한 be 동사, 날씨 표현 학습",
    tag1: "영상촬영",
    tag2: "팝송",
    date: "2024년 5월 24일",
    author: "김동우",
    image1: "/assets/study/detail/english1.svg",
    image2: "/assets/study/detail/english2.svg",
    editorNote:
      "‘you are my sunshine’ 팝송을 따라부르고, 적절한 손 안무를 만들어 숏폼 영상을 촬영합니다. 재미있게 be 동사와 날씨표현을 학습하고, 통문장 암기로 문장 구조를 배워봐요!",
    text1:
      "요즘 릴스나 쇼츠 안보는 아이들 없다는 건, 다들 알고 계시겠죠 ^^ (엄마인 저도 릴스나 쇼츠는 재미있게 보고 있답니다 ^^) 짧은 노래에 간단한 춤을 추는 모습을 영상으로 찍어서 공유하는 것은 이미 하나의 문화로 자리 잡고 있는데요. 우리 아이들이 숏폼 촬영도 하면서 놀이 활동을 하고, 동시에 영어 학습도 된다면 참 좋지 않겠어요 ~^^\n\n3학년 아이들의 수준에도 적당하면서, 7단원의 날씨표현과 be 동사 표현을 동시에 접할 수 있는 팝송인 ‘you are my sunshine’ 노래를 가지고 숏폼을 만들어보는 활동을 소개해드리고 싶습니다.\n\nYou are my sunshine 가사인데요. be 동사 개념도 들어가있고, 날씨표현도 들어가있는 것을 확인할 수 있으실거에요 ~ 게다가 가사가 얼마나 사랑스러운지, 이 노래를 종알거리는 우리 아이들 모습 상상하면 절로 미소가 지어지네요 :)",
    text2:
      "숏폼 영상 만드는 단계를 총 5개로 나눠봤는데요, 이대로만 따라하서 학습 지도하면 7단원 마스터는 시간문제!",
    text3:
      "step 1. 숏폼 영상을 만들기 전, 먼저 가사를 2-3번 정도 따라 읽어요.\nstep 2. 한글 해석을 통해 가사를 이해해요. 날씨 표현 관련 단어는 2-3번 정도 강조해서 알려주고, 따라 적어보는 것도 좋습니다.\nstep 3. 멜로디를 붙여 노래를 따라부르며 가사를 암기해요. 문장을 통으로 암기하는 효과가 있습니다.\nstep 4. 그리고 가사의 의미를 고려해 간단한 손 안무를 창작해요. 여러 번 연습하며 숏폼 리허설을 진행해보는 것도 좋겠어요.\nstep 5. 위챌 앱을 활용해 숏폼 영상을 촬영하면 끝!\n\n위챌 앱을 선택한 이유는, 다양한 AR필터와 알록달록 자막, 스티커를 지원하고 있기 때문! 조금만 만져도 고퀄리티의 숏폼 영상 제작이 가능하답니다. ^^\n\n완성한 숏폼 영상을 친구들과 공유하고 댓글과 좋아요로 격려하면 학습 효과는 배가 된답니다! 이게 노는 것인지, 공부하는 것인지! 전혀 ~ 공부로 느껴지지 않아서 학습 부담도 없다는 장점 ~\n\n다소 어려운 단원이지만, 즐겁게 헤쳐나가는 우리 아이들이 됐으면 좋겠습니다 ^^",
  },
];
